Reports/ПодробнаяСтатисткаWMIПоСерверам_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ПодробнаяСтатисткаWMIПоСерверам_ат</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Серверы_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДняИНочи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CPU</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RAM</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HDD</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/ТипыРесурсовWMI_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыРесурсовWMI_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CPU_proc</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AvgDiskQueueLength</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DiskBytesPersec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HDD_proc</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RAM_proc</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FreeMegabytesHDD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FreePhysicalMemory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Processes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>StaticSQL_ReCompilations_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Statistic_Batch_Requests_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Statistic_WorkfilesCreated_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PlanCache_CachePages</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PlanCache_percentSQLPlanCacheHitRation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BufferManager_percentBufferCacheHitRatio</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BufferManager_PageReads_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BufferManagerPageLifeExpectancy</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BufferManager_LazyWrites_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BufferManager_Checkpoints_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccessMethod_IndexSearches_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccessMethod_FullScans_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Databases_LogFlushWaitTime</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Databases_LogFlushWaits_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DatabaseReplicaRecoveryQueue</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DatabaseReplica_RedoneBytes_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Static_SQLCompilations_sec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Pagelifeexpectancy</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Buffercachehitratio</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PagereadsPersec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LazywritesPersec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IndexSearchesPersec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FullScansPersec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LogFlushWaitTime</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LogFlushWaitsPersec</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FactConnection</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ПодробнаяСтатисткаWMIПоСерверам_ат/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрСервер 					= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Сервер"));
	ПараметрСервер.Значение		= Сервер;
	ПараметрСервер.Использование	= Истина;

	ПараметрНачПер 					= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
	ПараметрНачПер.Значение		= ДатаНачала;
	ПараметрНачПер.Использование	= Истина;

	ПараметрКонПер					= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаКонца"));
	ПараметрКонПер.Значение		= ДатаКонца;
	ПараметрКонПер.Использование	= Истина;

	//ТипыРесурсов = новый СписокЗначений;
	//ТипыРесурсов.Добавить(Перечисления.ТипыРесурсовWMI_ат.CPU_proc);
	//ТипыРесурсов.Добавить(Перечисления.ТипыРесурсовWMI_ат.RAM_proc);
	//ТипыРесурсов.Добавить(Перечисления.ТипыРесурсовWMI_ат.HDD_proc);

	//ПараметрТипРес1						= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипыРесурсов"));
	//ПараметрТипРес1.Значение			= ТипыРесурсов;
	//ПараметрТипРес1.Использование	= Истина;
		
	ЗаполнениеГрафика(Сервер, CPU,Перечисления.ТипыРесурсовWMI_ат.CPU_proc,	ДатаНачала, ДатаКонца);
	ЗаполнениеГрафика(Сервер, RAM,Перечисления.ТипыРесурсовWMI_ат.RAM_proc,	ДатаНачала, ДатаКонца);
	ЗаполнениеГрафика(Сервер, HDD,Перечисления.ТипыРесурсовWMI_ат.HDD_proc,	ДатаНачала, ДатаКонца);
	
КонецПроцедуры


Процедура ЗаполнениеГрафика(Сервер, График, ТипРесурса, НачалоПериода, КонецПериода, ПериодДняИНочи	= 0)

График	= Новый ТабличныйДокумент;


// НачалоПериода	= ПоследниеДанныеАктуальныНа -УсредненныеЗначенияЗа*60*60;
// КонецПериода	= ПоследниеДанныеАктуальныНа;
// ТипРесурса1	= Перечисления.ТипыРесурсовWMI_ат.CPU_proc;
// ТипРесурса2	= Перечисления.ТипыРесурсовWMI_ат.RAM_proc;
// ТипРесурса3	= Перечисления.ТипыРесурсовWMI_ат.HDD_proc;


//Получаем схему из макета
//СхемаКомпоновкиДанных = Справочники.Серверы_ат.ПолучитьМакет("Макет");
//СхемаКомпоновкиДанных = Отчеты.ОбщийОтчетОПроизводительностиСервера_ат.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");


//СхемаКомпоновкиДанных = Отчет.КомпоновщикНастроек.П 
//ТипРесурса = Новый СписокЗначений;
//ТипРесурса.Добавить(ТипРесурса1);
//ТипРесурса.Добавить(ТипРесурса2);
//ТипРесурса.Добавить(ТипРесурса3);

СхемаКомпоновкиДанных = Отчеты.ПодробнаяСтатисткаWMIПоСерверам_ат.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

 КНКД = Новый КомпоновщикНастроекКомпоновкиДанных;
 КНКД.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
 КНКД.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
 КНКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Сервер", 			Сервер);
 //КНКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипыРесурсов", 	ТипРесурса);
 //КНКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",	НачалоПериода);
 //КНКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода",		КонецПериода);
 //КНКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",	НачалоПериода);
 //КНКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКонца",	КонецПериода);
 КНКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",		НачалоПериода);
 КНКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода",		КонецПериода);
 КНКД.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодДняИНочи",	ПериодДняИНочи);
 //КНКД.Настройки.ПараметрыВывода.ДоступныеПараметры

 // Компоновка макета
 
    КМКД = Новый КомпоновщикМакетаКомпоновкиДанных;
    Настройки = КНКД.Настройки;	
    МакетКомпоновкиДанных = КМКД.Выполнить(СхемаКомпоновкиДанных, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанных"));

	   // Инициализация процессора компоновки
 
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
    
    ПроцессорВывода = новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(График);
    ПроцессорВывода.НачатьВывод();

    Пока Истина Цикл
        ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
        Если ЭлементРезультата= Неопределено Тогда
            Прервать;
        Иначе
            ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
        КонецЕсли;
    КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();
	//График.Рисунки[0].Ширина = 100;	
	//График.Рисунки[0].Высота  = 50;

КонецПроцедуры
